package ex.com.sjunijen.study10;

public class Memo {
/**
 * Created by 시은 on 2016-09-11.

 1. 메인 화면 외에 하나의 화면을 추가로 만들고 이름은 'StudentInfoActivity'로 합니다.
 새로운 액티비티를 만들어 띄우려면 자바 소스 파일과 XML 레이아웃 파일을 만들고
 매니페이스에 액티비티를 등록해야 한다는 점을 잊지 말아야 합니다.
 2. StudentInfoActivity 화면에는 학생 정보를 보여줄 수 있도록
 이름과 나이를 표시할 수 잉ㅆ는 위젯들을 추가하고 그 아래쪽에는 [닫기] 버튼을 만듭니다.
 3. 메인 화면에는 두 개의 입력 상자를 만들고 '추가'라는 텍스트가 표시 된 버튼을 추가합니다.
 4. MainActivity.java 파일을 열고 첫 번째 입력 상자에 '김현수'라는 글자를 입력하고
 두 번째 입력 상자에 '15'라는 글자를 입력한 후 [추가] 버튼을 누르면,
 새 화면이 뜨면서 학생들의 이름과 나이가 보이도록 합니다.
 새로 띄운 화면에서 [닫기] 버튼을 누르면 메인 화면으로 다시 돌아가도록 합니다.
 5.메인 화면에서 새로운 화면을 띄울 때 인텐트 객체에 학생의 이름과 나이를 넣어 전달합니다.
 */
}
